OpenFOAM/Jet FLow/DoubleJet_Low Re/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       600;

stopAt          endTime;

//endTime         400;
endTime         1000;

deltaT          0.0005;

writeControl    adjustableRunTime;

//writeInterval   0.5;
writeInterval   1;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo          0.5;


maxDeltaT       0.1;



functions

{


#include "vorticity"

#include "mag"
  
#include  "timeStep" 
 
 /*
enstrophy
{
	type            enstrophy;
	libs            ("libfieldFunctionObjects.so");

	//U               U;
	//field           $U;

	executeControl  writeTime;
	writeControl    writeTime;

}
    */
    
    /*
   Q
{
	type            Q;
	libs            ("libfieldFunctionObjects.so");


	executeControl  writeTime;
	writeControl    writeTime;

}
    
       turbulenceIntensity
{
	type            turbulenceIntensity;
	libs            ("libfieldFunctionObjects.so");


	executeControl  writeTime;
	writeControl    writeTime;

}
*/

    /*
       enstrophy
{
	type            enstrophy;
	libs            ("libfieldFunctionObjects.so");


	executeControl  writeTime;
	writeControl    writeTime;

}

*/

  /*

    U_Mag
{
	type            mag;
	libs            ("libfieldFunctionObjects.so");


	field          U;

	executeControl  writeTime;
	writeControl    writeTime;

}

  */  
    
    /*
enstrophy_mean
{
    // Mandatory entries (unmodifiable)
    type                volFieldValue;
    libs            ("libfieldFunctionObjects.so");

    // Mandatory entries (runtime modifiable)

        fields          (enstrophy);
        operation       sum;
        regionType      all;
        writeFields     no;
        writeToFile     true;
        writeControl    runTime;
        writeInterval   0.1;

    
}
*/

/*

U_Mag_mean
{
    // Mandatory entries (unmodifiable)
    type                volFieldValue;
    libs            ("libfieldFunctionObjects.so");

    // Mandatory entries (runtime modifiable)

       // fields          (U);
        fields          (mag(U));
        operation       sum;

        operation sumMag ;
        
        regionType      all;
        writeFields     no;
        writeToFile     true;
        writeControl    runTime;
        writeInterval   0.1;

    
}
*/

dt
{
    // Mandatory entries (unmodifiable)
    type                timeStep;


        writeFields     no;
        writeToFile     true;
        writeControl    runTime;
        writeInterval   0.1;

    
}

clockTime
{
    // Mandatory entries (unmodifiable)
    type                time;


        writeFields     no;
        writeToFile     true;
        writeControl    runTime;
        writeInterval   0.1;

    
}




}
// ************************************************************************* //









