OpenFOAM/Jet FLow/DoubleJet_Low Re/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "1";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{


 left
    {

      type   fixedValue;  
      value  uniform 1;
    }
    
    right
    {

         type   zeroGradient;  

      
    }
    
    top
    {
        //  type            cyclic;
         type   zeroGradient;  
    }
    bottom
    {
       //  type            cyclic;
         type   zeroGradient;  
         
    }
    
    
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
 



}


// ************************************************************************* //
