OpenFOAM/Jet FLow/DoubleJet_Low Re/system/mag
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the magnitude of a field.

\*---------------------------------------------------------------------------*/

type            mag;
libs            ("libfieldFunctionObjects.so");

field           <fieldName>;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
