OpenFOAM/Jet FLow/DoubleJet_Low Re/system/timeStep
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes the time step to a file for monitoring.

\*---------------------------------------------------------------------------*/

type            timeStep;
libs            ("libutilityFunctionObjects.so");

writeControl    timeStep;
writeInterval   1;

// ************************************************************************* //
